Revit 2024 API
ExternalResourceSubFolder.IconPath Property
 The path of the resource icon.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019.1
Syntax
C#
public string IconPath { get; set; }
Visual Basic
Public Property IconPath As String
	Get
	Set
Visual C++
public:
property String^ IconPath {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace